STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE_Thread/Ble_Thread_Dyn_SED_FreeRTOS/STM32_WPAN/App/app_thread.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * File Name          : App/app_thread.c
 * Description        : Thread Application.
 ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "utilities_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_thread.h"
#include "stm32wbxx_core_interface_def.h"
#include "openthread_api_wb.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32_lpm.h"
#include "cmsis_os.h"
#if (CFG_USB_INTERFACE_ENABLE != 0)
#include "vcp.h"
#include "vcp_conf.h"
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */
#ifdef ENABLE_OPENTHREAD_CLI
#include "uart.h"
#endif /* ENABLE_OPENTHREAD_CLI */

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define C_SIZE_CMD_STRING       256U
#define C_PANID                 0x2222U
#define C_CHANNEL_NB            12U
#define THREAD_LINK_POLL_PERIOD         (5*1000*1000/CFG_TS_TICK_VAL) /**< 5s */

/* FreeRtos stacks attributes */
const osThreadAttr_t ThreadMsgM0ToM4Process_attr = {
  .name         = CFG_THREAD_MSG_M0_TO_M4_PROCESS_NAME,
  .attr_bits    = CFG_THREAD_MSG_M0_TO_M4_PROCESS_ATTR_BITS,
  .cb_mem       = CFG_THREAD_MSG_M0_TO_M4_PROCESS_CB_MEM,
  .cb_size      = CFG_THREAD_MSG_M0_TO_M4_PROCESS_CB_SIZE,
  .stack_mem    = CFG_THREAD_MSG_M0_TO_M4_PROCESS_STACK_MEM,
  .priority     = CFG_THREAD_MSG_M0_TO_M4_PROCESS_PRIORITY,
  .stack_size   = CFG_THREAD_MSG_M0_TO_M4_PROCESS_STACK_SIZE
};

const osThreadAttr_t ThreadCliProcess_attr = {
  .name         = CFG_THREAD_CLI_PROCESS_NAME,
  .attr_bits    = CFG_THREAD_CLI_PROCESS_ATTR_BITS,
  .cb_mem       = CFG_THREAD_CLI_PROCESS_CB_MEM,
  .cb_size      = CFG_THREAD_CLI_PROCESS_CB_SIZE,
  .stack_mem    = CFG_THREAD_CLI_PROCESS_STACK_MEM,
  .priority     = CFG_THREAD_CLI_PROCESS_PRIORITY,
  .stack_size   = CFG_THREAD_CLI_PROCESS_STACK_SIZE
 };

/* USER CODE BEGIN PD */
#define C_RESSOURCE             "light"

#define COAP_SEND_TIMEOUT               (3*1000*1000/CFG_TS_TICK_VAL) /**< 1s */

#define OT_AUTOSTART_MODE 1 // Automatic OT start and COAP after reset, set it to 1 for GRL testing
#define OT_COAP_START     0 // Automatic COAP start

/* FreeRtos stacks attributes */
const osThreadAttr_t ThreadSendCoapMsgProcess_attr = {
  .name         = CFG_THREAD_SEND_COAP_MSG_PROCESS_NAME,
  .attr_bits    = CFG_THREAD_SEND_COAP_MSG_PROCESS_ATTR_BITS,
  .cb_mem       = CFG_THREAD_SEND_COAP_MSG_PROCESS_CB_MEM,
  .cb_size      = CFG_THREAD_SEND_COAP_MSG_PROCESS_CB_SIZE,
  .stack_mem    = CFG_THREAD_SEND_COAP_MSG_PROCESS_STACK_MEM,
  .priority     = CFG_THREAD_SEND_COAP_MSG_PROCESS_PRIORITY,
  .stack_size   = CFG_THREAD_SEND_COAP_MSG_PROCESS_STACK_SIZE
};
/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
static void APP_THREAD_CheckWirelessFirmwareInfo(void);
static void APP_THREAD_DeviceConfig(void);
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext);
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode);
#if (CFG_FULL_LOW_POWER == 0)
static void Send_CLI_To_M0(void);
#endif /* (CFG_FULL_LOW_POWER == 0) */
static void Send_CLI_Ack_For_OT(void);
static void HostTxCb( void );
static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);
#if (CFG_USB_INTERFACE_ENABLE != 0)
static uint32_t ProcessCmdString(uint8_t* buf , uint32_t len);
#else
#if (CFG_FULL_LOW_POWER == 0)
static void RxCpltCallback(void);
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */
#ifdef ENABLE_OPENTHREAD_CLI
extern void otAppCliInit(otInstance *aInstance);
#endif /* ENABLE_OPENTHREAD_CLI */

/* FreeRTos wrapper functions */
static void APP_THREAD_FreeRTOSProcessMsgM0ToM4Task(void *argument);
#if (CFG_FULL_LOW_POWER == 0)
static void APP_THREAD_FreeRTOSSendCLIToM0Task(void *argument);
#endif /* (CFG_FULL_LOW_POWER == 0) */

/* USER CODE BEGIN PFP */
static void APP_THREAD_SendCoapMsg(void);
static void APP_THREAD_SendCoapMulticastRequest(uint8_t command);
static void APP_THREAD_CoapRequestHandler(void                * pContext,
                                          otMessage           * pMessage,
                                          const otMessageInfo * pMessageInfo);

static void APP_THREAD_FreeRTOSSendCoapMsgTask(void *argument);
static void APP_THREAD_CoapTimingElapsed( void );
static void APP_THREAD_SendCoapMsg(void );
static void APP_THREAD_StartCoapTimer(void);

/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
#if (CFG_USB_INTERFACE_ENABLE != 0)
static uint8_t TmpString[C_SIZE_CMD_STRING];
static uint8_t VcpRxBuffer[sizeof(TL_CmdSerial_t)];        /* Received Data over USB are stored in this buffer */
static uint8_t VcpTxBuffer[sizeof(TL_EvtPacket_t) + 254U]; /* Transmit buffer over USB */
#else
#if (CFG_FULL_LOW_POWER == 0)
static uint8_t aRxBuffer[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

#if (CFG_FULL_LOW_POWER == 0)
static uint8_t CommandString[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
static __IO uint16_t indexReceiveChar = 0;
static __IO uint16_t CptReceiveCmdFromUser = 0;

